// BSLLS:MissingVariablesDescription-off
// BSLLS:ExportVariables-off

&Заполнено(Сообщение = "Произвольное сообщение")
Перем Поле1 Экспорт;

&Заполнено
Перем Поле2 Экспорт;

&Минимум(-10)
&Максимум(10)
Перем Поле3 Экспорт;

&Валидно
Перем ВложенныйОбъект Экспорт;

&Тип("Число")
Перем Поле4 Экспорт;

&Тип("Массив")
&ДляКаждого
&Тип("Строка")
Перем КоллекцияСтрок Экспорт;

&Тип("Структура")
&ДляКаждого
&Тип("Число")
Перем СтруктураЧисел Экспорт;

&Тип("Соответствие")
&ДляКаждого("Ключ")
&Тип("Число")
Перем СоответствиеЧисловыхКлючей Экспорт;

&Тип("Массив")
&ДляКаждого("Ключ")
&Тип("Число")
Перем МассивСОграничениемКлючей Экспорт;

&Тип("Соответствие")
&ДляКаждого("Ключ")
&Тип("Число")
&Минимум(6)
Перем СоответствиеКлючиБольше5 Экспорт;

&Тип("Массив")
&ДляКаждого
&Тип("Число")
&Минимум(0)
&Максимум(10)
Перем МассивЧиселСДиапазоном Экспорт;
