// BSLLS:MissingVariablesDescription-off
// BSLLS:ExportVariables-off

&Заполнено(Сообщение = "Произвольное сообщение")
Перем Поле1 Экспорт;

&Заполнено
Перем Поле2 Экспорт;

&Минимум(-10)
&Максимум(10)
Перем Поле3 Экспорт;

&Шаблон("\d{3}-\d{2}")
Перем ПолеСШаблоном Экспорт;

&Размер(Минимум = 2, Максимум = 5)
Перем ПолеСРазмером Экспорт;

&Размер(Минимум = 2)
Перем ПолеСРазмеромБезВерхнейГраницы Экспорт;

&Тип("Массив")
&Размер(Максимум = 2)
Перем КоллекцияСРазмером Экспорт;

&ОдинИз(Значение = "создан", Значение = "оплачен", Значение = "отгружен")
Перем ПолеИзСписка Экспорт;

&ОдинИз(Значение = 1, Значение = 2, Значение = 3)
Перем ПолеИзЧисел Экспорт;

&Кратно(0.5)
Перем ПолеКратное Экспорт;

&Формат("email")
Перем ПолеПочты Экспорт;

&Формат("uuid")
Перем ПолеИдентификатора Экспорт;

&Формат("хитрый-формат")
Перем ПолеНеизвестногоФормата Экспорт;

&Валидно
Перем ВложенныйОбъект Экспорт;

&Тип("Число")
Перем Поле4 Экспорт;

&Тип("Массив")
&ДляКаждого
&Тип("Строка")
Перем КоллекцияСтрок Экспорт;

&Тип("Структура")
&ДляКаждого
&Тип("Число")
Перем СтруктураЧисел Экспорт;

&Тип("Соответствие")
&ДляКаждого("Ключ")
&Тип("Число")
Перем СоответствиеЧисловыхКлючей Экспорт;

&Тип("Массив")
&ДляКаждого("Ключ")
&Тип("Число")
Перем МассивСОграничениемКлючей Экспорт;

&Тип("Соответствие")
&ДляКаждого("Ключ")
&Тип("Число")
&Минимум(6)
Перем СоответствиеКлючиБольше5 Экспорт;

&Тип("Массив")
&ДляКаждого
&Тип("Число")
&Минимум(0)
&Максимум(10)
Перем МассивЧиселСДиапазоном Экспорт;
