// BSLLS:MissingVariablesDescription-off
// BSLLS:ExportVariables-off

&Заполнено(Сообщение = "Произвольное сообщение")
Перем Поле1 Экспорт;

&Заполнено
Перем Поле2 Экспорт;

&Минимум(-10)
&Максимум(10)
Перем Поле3 Экспорт;

&Валидно
Перем ВложенныйОбъект Экспорт;

&Тип("Число")
Перем Поле4 Экспорт;

&Тип("Массив")
&Тип("Строка", Применение = "Элемент")
Перем КоллекцияСтрок Экспорт;

&Тип("Структура")
&Тип("Число", Применение = "Элемент")
Перем СтруктураЧисел Экспорт;

&Тип("Соответствие")
&Тип("Число", Применение = "Ключ")
Перем СоответствиеЧисловыхКлючей Экспорт;

&Тип("Массив")
&Тип("Число", Применение = "Ключ")
Перем МассивСОграничениемКлючей Экспорт;

&Тип("Соответствие")
&Тип("Число", Применение = "Ключ")
&Минимум(6, Применение = "Ключ") // > 5
Перем СоответствиеКлючиБольше5 Экспорт;

&Тип("Массив")
&Тип("Число", Применение = "Элемент")
&Минимум(0, Применение = "Элемент")
&Максимум(10, Применение = "Элемент")
Перем МассивЧиселСДиапазоном Экспорт;
