#Использовать ".."
#Использовать "."
#Использовать 1testrunner
#Использовать asserts

&Тест
Процедура ВалидацияОграничениеЗаполненоРаботает() Экспорт

	// Дано
	Валидатор = Новый Валидатор;
	ТестовыйОбъект = Новый ТестовыйОбъект;
	ТестовыйОбъект.Поле1 = "Значение1";

	// Когда
	РезультатВалидации = Валидатор.Валидировать(ТестовыйОбъект);

	// Тогда
	Ожидаем.Что(РезультатВалидации).ИмеетДлину(1);

	Нарушение = РезультатВалидации[0];
	Ожидаем.Что(Нарушение.Объект()).Равно(ТестовыйОбъект);
	Ожидаем.Что(Нарушение.ИмяСвойства()).Равно("Поле2");
	Ожидаем.Что(Нарушение.ТипСвойства()).Равно("Поле");

КонецПроцедуры

ВалидацияОграничениеЗаполненоРаботает();
